# FamilyTemplatePath Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..FamilyTemplatePath Property
Application Class See Also
---
Default path for family template files.
**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public string FamilyTemplatePath { get; }
```

Visual Basic
---
```text
Public ReadOnly Property FamilyTemplatePath As String
	Get
```

Visual C++
---
```text
public:
property String^ FamilyTemplatePath {
	String^ get ();
}
```

# See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace